XML/Public/BUSQ01/request/body_BUSQ01.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:out="http://outsystem.ats.com.cn">
   <soapenv:Header/>
   <soapenv:Body>
      <out:outSystemWS>
         <out:in0>
         <![CDATA[
   <MBS>
  <pub>
    <SRCOUTSYSTEMCODE>A3</SRCOUTSYSTEMCODE>
    <SRCBATCHNO>JJ202104200001</SRCBATCHNO>
    <TRANSCODE>BUSQ01</TRANSCODE>
    <TRANSDATETIME>2021-04-13 10:00:00</TRANSDATETIME>
    <MD5>123456</MD5>
  </pub>
  <req>
   <list>
   <detail>
      <SRCOUTSYSTEMCODE>A3</SRCOUTSYSTEMCODE>
      <SRCNOTECODE>txbBUSQ01</SRCNOTECODE>
      <SCHEMECODE>接口测试计划2</SCHEMECODE>
      <ORGCODE>001000</ORGCODE>
      <DEPTCODE></DEPTCODE>
      <BEGINBALANCE>1000.00</BEGINBALANCE>
      <STARTYEAR>2021</STARTYEAR>
      <STARTSEASON></STARTSEASON>
      <STARTMONTH>4</STARTMONTH>
       <STARTPERIODPART></STARTPERIODPART>
       <STARTWEEK></STARTWEEK>
       <ENDYEAR>2021</ENDYEAR>
       <ENDSEASON></ENDSEASON>
       <ENDMONTH>4</ENDMONTH>
       <ENDPERIODPART></ENDPERIODPART>
       <ENDWEEK></ENDWEEK>
       <DESCRIPTION></DESCRIPTION>
        <itemlist>
        <itemdetail>
        <BUDGETITEMCODE>JH0101</BUDGETITEMCODE>
        <CURRENCYCODE>CNY</CURRENCYCODE>
        <BUDGETYEAR>2021</BUDGETYEAR>
        <BUDGETSEASON></BUDGETSEASON>
        <BUDGETMONTH>4</BUDGETMONTH>
        <BUDGETPERIODPART></BUDGETPERIODPART>
        <BUDGETWEEK></BUDGETWEEK>
        <BUDGETDAY></BUDGETDAY>
        <BUDGETAMOUNT>500</BUDGETAMOUNT>
        <REFBUDGETAMOUNT1>1</REFBUDGETAMOUNT1>
        <REFBUDGETAMOUNT2>2</REFBUDGETAMOUNT2>
        <REFBUDGETAMOUNT3>3</REFBUDGETAMOUNT3>
        <REFBUDGETAMOUNT4>4</REFBUDGETAMOUNT4>
        <REFBUDGETAMOUNT5>5</REFBUDGETAMOUNT5>
        <REFBUDGETAMOUNT6>6</REFBUDGETAMOUNT6>
        <REFBUDGETAMOUNT7>7</REFBUDGETAMOUNT7>
        <REFBUDGETAMOUNT8>8</REFBUDGETAMOUNT8>
        <REFBUDGETAMOUNT9>9</REFBUDGETAMOUNT9>
        <REFBUDGETAMOUNT10>10</REFBUDGETAMOUNT10>
        <DESCRIPTION>备注</DESCRIPTION>
        </itemdetail>   
        </itemlist>
     </detail>
    </list>
  </req>
</MBS>
    ]]>
         </out:in0>
      </out:outSystemWS>
   </soapenv:Body>
</soapenv:Envelope>